
require("trouble").setup {
  position = "bottom", -- розташування списку: bottom (внизу), top (вгорі), left (зліва), right (справа)
  height = 10, -- висота списку "trouble" при розташуванні вгорі або внизу
  width = 50, -- ширина списку "trouble" при розташуванні зліва або справа
  icons = true, -- використовувати іконки для імен файлів
  mode = "workspace_diagnostics", -- режими: "lsp_workspace_diagnostics", "lsp_document_diagnostics", "quickfix", "lsp_references", "loclist"
  fold_open = "", -- іконка для відкритих згорток
  fold_closed = "", -- іконка для закритих згорток
  group = true, -- групувати результати за файлами
  padding = true, -- додавати додатковий новий рядок зверху списку
  action_keys = { -- клавіші для дій у списку "trouble"
      close = "q", -- закрити список
      cancel = "<esc>", -- скасувати попередній перегляд і повернутися до останнього вікна / буфера / курсора
      refresh = "r", -- вручну оновити
      jump = {"<cr>", "<tab>"}, -- перейти до діагностики або відкрити/закрити згортки
      open_split = { "<c-x>" }, -- відкрити буфер у новому спліті
      open_vsplit = { "<c-v>" }, -- відкрити буфер у новому вертикальному спліті
      open_tab = { "<c-t>" }, -- відкрити буфер у новій вкладці
      jump_close = {"o"}, -- перейти до діагностики і закрити список
      toggle_mode = "m", -- перемикатися між режимами "workspace" і "document" для діагностики
      toggle_preview = "P", -- перемикатися для попереднього перегляду
      hover = "K", -- відкрити мале спливаюче вікно з повним повідомленням
      preview = "p", -- попередній перегляд місця діагностики
      close_folds = {"zM", "zm"}, -- закрити всі згортки
      open_folds = {"zR", "zr"}, -- відкрити всі згортки
      toggle_fold = {"zA", "za"}, -- перемикати згортку поточного файлу
      previous = "k", -- попередній елемент
      next = "j" -- наступний елемент
  },
  indent_lines = true, -- додавати відступи під іконками згорток
  auto_open = false, -- автоматично відкривати список при наявності діагностик
  auto_close = false, -- автоматично закривати список, коли немає діагностик
  auto_preview = true, -- автоматично показувати попередній перегляд місця діагностики
  auto_fold = false, -- автоматично згортати список файлів при створенні
  auto_jump = {"lsp_definitions"}, -- автоматичний перехід, якщо є лише один результат для вказаних режимів
  signs = {
      error = "", -- іконка для помилок
      warning = "", -- іконка для попереджень
      hint = "󰋗", -- іконка для підказок
      information = "", -- іконка для інформаційних повідомлень
      other = "" -- іконка для інших діагностик
  },
  use_lsp_diagnostic_signs = false -- використовувати знаки, визначені в клієнті LSP
}
